Container.puml
@startuml BibliotecaContainer
!includeurl https://raw.githubusercontent.com/plantuml-stdlib/C4-PlantUML/master/C4_Container.puml

Person_Ext(usuario, "Usuário", "Usuário que interage com o sistema")
Container(webapp, "Aplicação Web", "React", "Front da aplicação web")
Container(mobileapp, "Aplicação Mobile", "React Native", "Front da aplicação mobile")
Container(api, "API Backend", ".Net 9", "Funcionalidades do Backend")
ContainerDb(database, "Banco de dados", "PostgreSQL", "Banco de dados")

Rel(usuario, webapp, "Usa")
Rel(usuario, mobileapp, "Usa")
Rel(webapp, api, "Requisições HTTPS")
Rel(mobileapp, api, "Requisições HTTPS")
Rel(api, database, "SQL", "Usa")

@enduml
